eisup_2019_docmng_integration/src/Catalogs/абс_НастройкиАвтоВосстановленияПоследовательности/абс_НастройкиАвтоВосстановленияПоследовательности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_НастройкиАвтоВосстановленияПоследовательности</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Принадлежность</name>
    <type>
      <types>EnumRef.абс_ПринадлежностьПотока</types>
    </type>
  </attributes>
  <attributes>
    <name>Поток</name>
    <type>
      <types>CatalogRef.абс_Потоки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапрета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередвигатьГраницуПоВсемДоговорам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/абс_НастройкиАвтоВосстановленияПоследовательности/ObjectModule.bsl
Перем мРегламентноеЗадание Экспорт;

Процедура УстановитьПараметрыРегламентногоЗадания(РеквизитЗадания, ПараметрЗадания, КлючРегламентногоЗадания = "", Постфикс = "")
	
	Если ПараметрЗадания = Неопределено Тогда
		
		РеквизитЗадания = "";
		
	Иначе	
		
		РеквизитЗадания = Строка(ПараметрЗадания.УникальныйИдентификатор);
		
		ПараметрЗадания.Наименование = Наименование + Постфикс;
		// генерируем уникальный ключ, что бы в один момент времени 2 регламентных задания не выполнялись
		Если ПустаяСтрока(ПараметрЗадания.Ключ) Тогда
			ПараметрЗадания.Ключ = РеквизитЗадания;
		КонецЕсли;
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить(Ссылка);
		
		ПараметрЗадания.Параметры = МассивПараметров;
		
		ПараметрЗадания.ИмяПользователя 	= СокрЛП(Ответственный.Код);
		ПараметрЗадания.Ключ 				= РегламентноеЗадание;
		ПараметрЗадания.Использование 		= Использование;
		
		ПараметрЗадания.Записать();	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если мРегламентноеЗадание <> Неопределено Тогда
				
		УстановитьПараметрыРегламентногоЗадания(РегламентноеЗадание, мРегламентноеЗадание);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РегламентноеЗадание = Неопределено;
	
КонецПроцедуры
